backend/app/controllers/cards_controller.rb

  def index
    stack = Stack.find(params[:stack_id])
---
SELECT "stacks".* FROM "stacks" WHERE "stacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    card = Card.create(card_params)
---
INSERT INTO "cards" ("front", "back", "stack_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["front", "Apple"], ["back", "Alma"], ["stack_id", 1], ["created_at", "2020-10-08 20:16:43.998187"], ["updated_at", "2020-10-08 20:16:43.998187"]]