backend/app/controllers/stacks_controller.rb

SELECT "stacks".* FROM "stacks"
---
  def index
    stacks = Stack.all

SELECT "stacks".* FROM "stacks" WHERE "stacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    stack = Stack.find(params[:id])

INSERT INTO "stacks" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "French"], ["created_at", "2020-10-08 20:05:45.226807"], ["updated_at", "2020-10-08 20:05:45.226807"]]
---
  def create
    stack = Stack.create(stack_params)